app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "number 1"], ["summary", "hgutyg"], ["body", "uhihi"], ["created_at", "2022-08-06 14:56:31.350332"], ["updated_at", "2022-08-06 14:56:31.350332"]]

	def update
		if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "summary" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "13 title"], ["summary", "13 summary"], ["body", "13 body"], ["updated_at", "2022-08-02 11:10:44.976295"], ["id", 3]]

	def destroy
		@post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]

	def set_post
		@post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]